ERP.belugaerp/src/InformationRegisters/бг_МинимальныеЦеныАлкогольнойПродукции/бг_МинимальныеЦеныАлкогольнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_МинимальныеЦеныАлкогольнойПродукции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕмкостьТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЛицензии</name>
    <type>
      <types>EnumRef.бг_ТипыЛицензийПоставщиковАлкогольнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_ТипыЛицензийПоставщиковАлкогольнойПродукции/бг_ТипыЛицензийПоставщиковАлкогольнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ТипыЛицензийПоставщиковАлкогольнойПродукции</name>
  <enumValues>
    <name>Импорт</name>
    <comment>Лицензия на импорт</comment>
  </enumValues>
  <enumValues>
    <name>Оптовая</name>
  </enumValues>
  <enumValues>
    <name>Перевозка</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Розничная</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
    <comment>Лицензия на хранение алкоголя</comment>
  </enumValues>
  <enumValues>
    <name>Экспорт</name>
    <comment>Лицензия на экспорт алкоголя</comment>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>бг_АнализыДляУдостоверенияОКачестве</name>
    <type>
      <types>CatalogRef.бг_ТиповыеАнализыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Вариативность</name>
    <type>
      <types>CatalogRef.бг_ВариативностьНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Выбыл</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Добавлен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕК_СУМ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СУМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНоменклатурыSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КонтрагентПроизводитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НормативныйДокумент</name>
    <type>
      <types>CatalogRef.бг_НормативныеДокументыСертификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбменB2B</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОписаниеСоставаПродукта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновноеНаименование</name>
    <type>
      <types>CatalogRef.бг_ОсновныеНаименованияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Предшественник</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокГодности</name>
    <type>
      <types>CatalogRef.бг_ЕК_Номенклатура_СрокГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокХраненияПробВЛабораторииМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаПроизводителя</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипИмпортныхССП</name>
    <type>
      <types>EnumRef.бг_ТипыИмпортныхССП</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипМарки</name>
    <type>
      <types>CatalogRef.бг_КлассификаторТиповМарок</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УсловияТранспортирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ФайлПиктограммы</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_СпособыОбеспеченияПотребности</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбеспеченияПотребностей</name>
      <type>
        <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/CommonModules/бг_МинимальныеЦеныАлкогольнойПродукцииИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт

	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.УстановитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
		
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства);	
	ДобавитьКлючевыеРеквизиты(РеквизитыИСвойства);
		
КонецПроцедуры

Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей, ПараметрыЗапроса, НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт
	
	ТекстЗапросаТаблицаКлючей = "";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВыгружаемыйОбъект.ПериодОкончания КАК ДатаОкончания",
		"ВЫБОР
		|	  КОГДА ВыгружаемыйОбъект.ПериодОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
		|		ИНАЧЕ ВыгружаемыйОбъект.ПериодОкончания
		|	КОНЕЦ КАК ДатаОкончания");

	ПараметрыЗапроса.Вставить("ТипЛицензии", Перечисления.бг_ТипыЛицензийПоставщиковАлкогольнойПродукции.Оптовая);
	
КонецПроцедуры

Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт
	  
	Перем адаптер_РаботаСДаннымиИБ;
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	ПараметрыВыполненияЗапросов = адаптер_РаботаСДаннымиИБ.ПолучитьПараметрыВыполненияЗапросов(Объект, ДанныеСообщения);

	ПроверятьДополнительныеУсловия = Ложь;
	Если Не ДанныеСообщения.ДополнительныеСвойстваОбъекта.Свойство(
		"адаптер_ПроверятьДополнительныеУсловияПриПолученииДанныхВыгружаемогоОбъекта", ПроверятьДополнительныеУсловия) Тогда
    	ПроверятьДополнительныеУсловия = Ложь;
	КонецЕсли;
	
	РезультатЗапроса = адаптер_РаботаСДаннымиИБ.ПолучитьРезультатЗапроса(ПараметрыВыполненияЗапросов.ТекстыЗапросов.ТекстЗапроса,
		ПараметрыВыполненияЗапросов.ПараметрыЗапроса,
		ПараметрыВыполненияЗапросов.ТаблицаОтбора,
		ПроверятьДополнительныеУсловия);
		
	Реквизиты = адаптер_РаботаСДаннымиИБ.РезультатЗапросаВСтруктуруРеквизитов(РезультатЗапроса, ПараметрыВыполненияЗапросов.ТаблицаКлючей, ДанныеСообщения);
	РеквизитыСообщения = Новый Массив;

	Если Реквизиты.Количество() > 0 Тогда
		РеквизитыОбъекта = Реквизиты[0];
		
		Крепость = 0;
		Если Не РеквизитыОбъекта.Свойство("Крепость", Крепость) Тогда
			Крепость = 0;	
		КонецЕсли; 
		
		ЕмкостьТары = 0;
		Если Не РеквизитыОбъекта.Свойство("ЕмкостьТары", ЕмкостьТары) Тогда
			ЕмкостьТары = 0;
		КонецЕсли; 
		
		ВидАлкогольнойПродукции = Неопределено;
		РеквизитыОбъекта.Свойство("ВидАлкогольнойПродукции", ВидАлкогольнойПродукции); 
		
		СкюМТ = СкюМТ(РеквизитыОбъекта.ДатаНачала, ВидАлкогольнойПродукции, РеквизитыОбъекта.Цена, Крепость, ЕмкостьТары);
		
		Если РеквизитыОбъекта.Свойство("ВидАлкогольнойПродукции") Тогда
			РеквизитыОбъекта.Удалить("ВидАлкогольнойПродукции");
		КонецЕсли; 
		
		Если РеквизитыОбъекта.Свойство("Крепость") Тогда
			РеквизитыОбъекта.Удалить("Крепость");
		КонецЕсли; 
		
		Если РеквизитыОбъекта.Свойство("ЕмкостьТары") Тогда
			РеквизитыОбъекта.Удалить("ЕмкостьТары");
		КонецЕсли; 
		
		Для каждого ЭлементСкюМТ Из СкюМТ Цикл
			ДанныеЗаполнения = ОбщегоНазначения.СкопироватьРекурсивно(РеквизитыОбъекта);				
			ДанныеЗаполнения.Вставить("Цена", ЭлементСкюМТ.Цена);
			ДанныеЗаполнения.Вставить("ДанныеСкюМТ", ЭлементСкюМТ.СКЮ);
			РеквизитыСообщения.Добавить(ДанныеЗаполнения);
		КонецЦикла; 
		
	КонецЕсли; 
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ПолноеИмя", ПараметрыВыполненияЗапросов.ПолноеИмя);
	СтруктураРезультат.Вставить("Реквизиты", РеквизитыСообщения);
	СтруктураРезультат.Вставить("Отбор", Новый Массив);
	
	Возврат СтруктураРезультат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	ВыгружаемыеРеквизиты = Новый Массив;
	
	ВыгружаемыеРеквизиты.Добавить("ВидАлкогольнойПродукции");
	ВыгружаемыеРеквизиты.Добавить("Цена");
	ВыгружаемыеРеквизиты.Добавить("Крепость");
			
	Возврат ВыгружаемыеРеквизиты;
	
КонецФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		"ЕмкостьТары",
		,
		ОбщегоНазначения.ОписаниеТипаЧисло(10,3));
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		"Период",
		"ДатаНачала",
		Новый ОписаниеТипов("Дата"));
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		"ПериодОкончания",
		"ДатаОкончания",
		Новый ОписаниеТипов("Дата"));
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		,
		"ДанныеСкюМТ.СкюМТ",
		Новый ОписаниеТипов("СправочникСсылка.бг_ЕК_СКЮ_СкюМТ"));
				
КонецПроцедуры

Процедура ДобавитьКлючевыеРеквизиты(РеквизитыИСвойства)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.бг_ЕК_СКЮ_СкюМТ,
		"Код",
		,
		ОбщегоНазначения.ОписаниеТипаСтрока(15));
		
КонецПроцедуры

Функция СкюМТ(Период, ВидНоменклатуры, Цена, Крепость, ЕмкостьТары)
	
	СКЮ = Новый Массив;
	
	Если ЕмкостьТары = 0 Тогда
		ЦенаЗаПолЛитра = Цена;
	Иначе
		ЦенаЗаПолЛитра = Цена / (ЕмкостьТары / 0.5);
	КонецЕсли; 
	
	ВидАлкогольнойПродукцииДляКонтроляМРЦПрочихЛВИ = бг_КонстантыПовтИсп.ЗначениеКонстанты("ВидАлкогольнойПродукцииДляКонтроляМРЦПрочихЛВИ");
	
	Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		
		ВидАлкогольнойПродукции = Справочники.ВидыАлкогольнойПродукции.ПолучитьСсылку(
			Новый УникальныйИдентификатор(ВидНоменклатуры.Идентификатор));
		
	Иначе
		
		ВидАлкогольнойПродукции = Справочники.ВидыАлкогольнойПродукции.ПустаяСсылка();
		
	КонецЕсли; 
	
	Если ВидАлкогольнойПродукции <> ВидАлкогольнойПродукцииДляКонтроляМРЦПрочихЛВИ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.ТоварнаяКатегория.бг_СкюМТ КАК СКЮ_МТ,
		|	Номенклатура.ТоварнаяКатегория.бг_СкюМТ.Код КАК Код,
		|	Выразить(ВЫБОР
		|		КОГДА &ЕмкостьТары = 0
		|			ТОГДА &Цена * 2 * Номенклатура.ОбъемДАЛ * 10
		|		ИНАЧЕ &Цена / &ЕмкостьТары * Номенклатура.ОбъемДАЛ * 10
		|	КОНЕЦ КАК Число(15,2)) КАК Цена
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ВидАлкогольнойПродукции = &ВидАлкогольнойПродукции
		|	И (Номенклатура.Крепость > &Крепость 
		|		И Номенклатура.Крепость <= &Крепость + 1
		|			ИЛИ &Крепость = 0)
		|	И НЕ Номенклатура.ТоварнаяКатегория.бг_СкюМТ ЕСТЬ NULL
		|ИТОГИ ПО
		|	Цена";
		
		Запрос.УстановитьПараметр("ВидАлкогольнойПродукции", ВидАлкогольнойПродукции);
		Запрос.УстановитьПараметр("Крепость", Крепость);
		Запрос.УстановитьПараметр("ЕмкостьТары", ЕмкостьТары);
		Запрос.УстановитьПараметр("Цена", ЦенаЗаПолЛитра);
		
		РезультатЗапроса = Запрос.Выполнить();
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бг_МинимальныеЦеныАлкогольнойПродукцииСрезПоследних.ВидАлкогольнойПродукции
		|ПОМЕСТИТЬ ВТ_ИсключаемыеВидыАлкогольнойПродукции
		|ИЗ
		|	РегистрСведений.бг_МинимальныеЦеныАлкогольнойПродукции.СрезПоследних(&Период, ТипЛицензии = ЗНАЧЕНИЕ(Перечисление.бг_ТипыЛицензийПоставщиковАлкогольнойПродукции.Оптовая)) КАК бг_МинимальныеЦеныАлкогольнойПродукцииСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.ТоварнаяКатегория.бг_СкюМТ КАК СКЮ_МТ,
		|	Номенклатура.ТоварнаяКатегория.бг_СкюМТ.Код КАК Код,
		|	Выразить(ВЫБОР
		|		КОГДА &ЕмкостьТары = 0
		|			ТОГДА &Цена * 2 * Номенклатура.ОбъемДАЛ * 10
		|		ИНАЧЕ &Цена / &ЕмкостьТары * Номенклатура.ОбъемДАЛ * 10
		|	КОНЕЦ КАК Число(15,2)) КАК Цена
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ВидАлкогольнойПродукции В
		|				(ВЫБРАТЬ
		|					Т.ВидАлкогольнойПродукции
		|				ИЗ
		|					ВТ_ИсключаемыеВидыАлкогольнойПродукции КАК Т)
		|	И (Номенклатура.Крепость > &Крепость 
		|		И Номенклатура.Крепость <= &Крепость + 1
		|			ИЛИ &Крепость = 0)
		|	И НЕ Номенклатура.ТоварнаяКатегория.бг_СкюМТ ЕСТЬ NULL
		|ИТОГИ ПО
		|	Цена";
		
		Запрос.УстановитьПараметр("ВидАлкогольнойПродукции", ВидАлкогольнойПродукции);
		Запрос.УстановитьПараметр("Крепость", Крепость);
		Запрос.УстановитьПараметр("ЕмкостьТары", ЕмкостьТары);
		Запрос.УстановитьПараметр("Цена", ЦенаЗаПолЛитра);
		Запрос.УстановитьПараметр("Период", Период);

		РезультатЗапроса = Запрос.Выполнить();
		
	КонецЕсли;
	
	ВыборкаПоЦене = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Цена");
	Пока ВыборкаПоЦене.Следующий() Цикл
		ДанныеПоЦене = Новый Структура("Цена", ВыборкаПоЦене.Цена);		
		СоставСКЮ = Новый Массив;
		Выборка = ВыборкаПоЦене.Выбрать();
		Пока Выборка.Следующий() Цикл
			СоставСКЮ.Добавить(
			Новый Структура("СкюМТ",
				Новый Структура(
					"Идентификатор, Код",
					Строка(Выборка.СКЮ_МТ.УникальныйИдентификатор()),
					Выборка.Код)));	
		КонецЦикла; 
		ДанныеПоЦене.Вставить("СКЮ", СоставСКЮ);
		СКЮ.Добавить(ДанныеПоЦене);
	КонецЦикла; 
	
	Возврат СКЮ;
	
КонецФункции 
 
#КонецОбласти
